---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SheetApprovedBy
source: html/ebdfba4e-47a4-6e6e-f729-c700a4dcab7a.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SheetApprovedBy Property

"Approved By"

## Syntax (C#)
```csharp
public static ForgeTypeId SheetApprovedBy { get; }
```